Revit 2027 API
TextNote.RemoveLeaders Method
 Removes all leaders currently attached to the text note.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveLeaders()
Public Sub RemoveLeaders
public:
void RemoveLeaders()
member RemoveLeaders : unit -> unit
See Also
Reference
TextNote Class
Autodesk.Revit.DB Namespace